import random

dict = {
    "北海道": "ジンギスカン",
    "青森県": "りんご",
    "岩手県": "わんこそば",
    "宮城県": "牛タン",
    "秋田県": "きりたんぽ鍋",
    "山形県": "芋煮",
    "福島県": "ソースカツ丼",
    "茨城県": "納豆",
    "栃木県": "いちご",
    "群馬県": "こんにゃく",
    "埼玉県": "さといも",
    "千葉県": "落花生",
    "東京都": "江戸前寿司",
    "神奈川県": "サンマーメン",
    "山梨県": "信玄餅",
    "長野県": "信州そば",
    "新潟県": "コシヒカリ",
    "富山県": "ますずし",
    "石川県": "加賀野菜",
    "福井県": "越前ガニ",
    "岐阜県": "朴葉味噌",
    "静岡県": "うなぎ",
    "愛知県": "味噌カツ",
    "三重県": "伊勢うどん",
    "滋賀県": "近江牛",
    "京都府": "京料理",
    "大阪府": "たこ焼き",
    "兵庫県": "明石焼き",
    "奈良県": "柿の葉寿司",
    "和歌山県": "梅干し",
    "鳥取県": "松葉ガニ",
    "島根県": "出雲そば",
    "岡山県": "桃",
    "広島県": "お好み焼き",
    "山口県": "瓦そば",
    "徳島県": "阿波尾鶏",
    "香川県": "讃岐うどん",
    "愛媛県": "みかん",
    "高知県": "カツオのたたき",
    "福岡県": "明太子",
    "佐賀県": "有田焼",
    "長崎県": "ちゃんぽん",
    "熊本県": "馬刺し",
    "大分県": "かぼす",
    "宮崎県": "辛麺",
    "鹿児島県": "黒豚",
    "沖縄県": "サーターアンダーギー",
}

Q = random.choice(dict.items())
while True:
    answer = input(f"{Q[0]}の名物は何ですか？：")
    if answer == Q[1]:
        print("正解です！")
        break
    else:
        print("不正解です。もう一度挑戦してください。")
    a = input("もう一度挑戦しますか？ yes no:")
    if a.lower() == "yes":
        continue
    else:
        print(f"正解は {Q[1]} でした。")
        break
